/*
	Copyright (c) 2022-2025, The igLibrary Contributors.
	igLibrary and its libraries are free software: You can redistribute it and
	its libraries under the terms of the Apache License 2.0 as published by
	The Apache Software Foundation.
	Please see the LICENSE file for more details.
*/


using System.Runtime.InteropServices;
using System.Diagnostics;

namespace igLibrary.DotNet
{
	public static class VvlLoader
	{
		/* Steps:
		 * Read Header
		 * Read sections into buffers
		 * Read DotNetMethodMeta array
		 * Read DotNetTypeDetails array
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * DotNet more like DeezNuts amirite 
		*/
		public static DotNetLibrary Load(string libName, DotNetRuntime runtime, out bool success)
		{
			DotNetLibrary? library;
			if(CDotNetaManager._Instance._libraries.TryGetValue(libName, out library))
			{
				success = true;
				return library;
			}
			//Open file
			igFileContext.Singleton.Open(libName, igFileContext.GetOpenFlags(FileAccess.Read, FileMode.Open), out igFileDescriptor fd, igBlockingType.kMayBlock, igFileWorkItem.Priority.kPriorityNormal);
			StreamHelper sh = new StreamHelper(fd._handle, StreamHelper.Endianness.Little);

			//Endianness
			if(sh.ReadUInt32() == 0x08000000) sh._endianness = StreamHelper.Endianness.Big;

			//Read Header
			sh.Seek(0);
			VvlHeader header = sh.ReadStruct<VvlHeader>();			
			Debug.Assert(header._sizeofSize == 0x28);

			//Prepare library and resolver

		public static DotNetMethodDefinition? ConvertMethodDef(igDotNetLoadResolver resolver, VvlMethodDef methodDef, StreamHelper strings, out int methodIndex, DotNetLibrary library, StreamHelper? IL)
		{
			if(!TypeResolverHelper(resolver, false, ElementType.kElementTypeObject, ReadVvlString(strings, methodDef._declaringTypeName), out DotNetType declaringType))
			{
				methodIndex = 0;
				return null;
			}

			DotNetMethodDefinition dnMethodDef = new DotNetMethodDefinition();
			dnMethodDef._name = ReadVvlString(strings, methodDef._methodName);
			dnMethodDef._declaringType = declaringType;

			if(!TypeResolverHelper(resolver, methodDef._isReturnArray != 0, methodDef._returnElementType, ReadVvlString(resolver._stringTable, methodDef._returnTypeName), out dnMethodDef._retType))
			{
				dnMethodDef._retType._baseMeta = igArkCore.GetObjectMeta("Object");
				dnMethodDef._retType._flags = (uint)ElementType.kElementTypeObject;
			}

			dnMethodDef._stackHeight = methodDef._stackHeight;
			dnMethodDef._flags = methodDef._flags;
			dnMethodDef._methodIndex = methodDef._methodIndex;
			if(IL != null)
			{
				dnMethodDef._IL = new igVector<byte>();
				dnMethodDef._IL.SetCapacity((int)methodDef._ILCount);
				IL.Seek(methodDef._ILOffset);
				for(int i = 0; i < methodDef._ILCount; i++)
				{
					dnMethodDef._IL.Append(IL.ReadByte());
				}
			}
			methodIndex = dnMethodDef._methodIndex;
			dnMethodDef._owner = library;
			dnMethodDef._parameters.SetCapacity(methodDef._paramCount);
			for(int i = 0; i < methodDef._paramCount; i++)
			{
				dnMethodDef._parameters.Append(library._referencedTypes[methodDef._paramStartIndex + i]);
			}
			dnMethodDef._locals.SetCapacity(methodDef._localCount);
			for(int i = 0; i < methodDef._localCount; i++)
			{
				dnMethodDef._locals.Append(library._referencedTypes[methodDef._localStartIndex + i]);
			}
			return dnMethodDef;
		}
		public static bool TypeResolverHelper(igDotNetLoadResolver resolver, bool isArray, ElementType elementType, string name, out DotNetType dnt)
		{
			if(elementType != ElementType.kElementTypeObject || isArray)
			{
				dnt = new DotNetType();
				dnt._flags = 0;
				if(elementType != ElementType.kElementTypeObject)
				{
					dnt._flags = (uint)DotNetType.Flags.kIsSimple;
				}
				dnt._flags |= (uint)elementType | (isArray ? 0 : (uint)DotNetType.Flags.kIsArray);
				return true;
			}
			igDotNetTypeReference dntr = new igDotNetTypeReference(resolver, isArray, elementType, name);
			while(true)
			{
				if(!dntr.TryResolveObject(out dnt))
				{
					int nsIndex = dntr._name.IndexOf('.');
					if(nsIndex >= 0) dntr._name = dntr._name.Substring(nsIndex+1);
					//else throw new TypeLoadException($"Failed to find class {typeName}");
					else
					{
						return false;
					}
				}
				else break;
			}
			if(dntr._name != name)
			{
				dntr._resolver._aliases.TryAdd(name, dntr._name);
			}
			return true;
		}

		[StructLayout(LayoutKind.Explicit, Size = 0x28)]
		public struct VvlHeader
		{
			[FieldOffset(0x00)] public uint unk00;
			[FieldOffset(0x04)] public uint _sizeofSize;
			[FieldOffset(0x08)] public uint _stringTableLength;
			[FieldOffset(0x0C)] public uint _numMethodRefs;
			[FieldOffset(0x10)] public uint _fieldCount;
			[FieldOffset(0x14)] public uint _methodCount;
			[FieldOffset(0x18)] public uint _parameterCount;
			[FieldOffset(0x1C)] public uint _attributeCount;
			[FieldOffset(0x20)] public uint unk20;
			[FieldOffset(0x24)] public uint _typeDetailLength;
		}
		[StructLayout(LayoutKind.Explicit, Size = 0x18)]
		public struct SDotNetMethodMeta
		{
			[FieldOffset(0x00)] public uint _sizeofSize;
			[FieldOffset(0x04)] public uint _importTag;
			[FieldOffset(0x08)] public uint _methodName;
			[FieldOffset(0x0C)] public uint _entryPoint;
			[FieldOffset(0x10)] public uint _retParamIndex;
			[FieldOffset(0x14)] public uint _paramIndex;
		}
	[StructLayout(LayoutKind.Explicit, Size = 0x54)]
	public struct VvlMethodDef
	{
		[FieldOffset(0x00)] public uint _sizeofSize;
		[FieldOffset(0x04)] public uint _declaringTypeName;
		[FieldOffset(0x10)] public uint _methodName;
		[FieldOffset(0x20)] public int _paramCount;
		[FieldOffset(0x24)] public int _localCount;
		[FieldOffset(0x28)] public int _stackHeight;
		[FieldOffset(0x2C)] public ElementType _returnElementType;
		[FieldOffset(0x30)] public int _isReturnArray;
		[FieldOffset(0x34)] public uint _returnTypeName;
		[FieldOffset(0x40)] public int _paramStartIndex;
		[FieldOffset(0x44)] public int _localStartIndex;
		[FieldOffset(0x48)] public uint _ILOffset;
		[FieldOffset(0x4C)] public uint _ILCount;
		[FieldOffset(0x50)] public ushort _flags;
		[FieldOffset(0x52)] public ushort _methodIndex;
	}
	[StructLayout(LayoutKind.Explicit, Size = 0x30)]
	public struct VvlFieldDefinition
	{
		[FieldOffset(0x00)] public uint _sizeofSize;
		[FieldOffset(0x04)] public uint _name;
		[FieldOffset(0x08)] public DotNetFieldDefinition.FieldDefFlags _flags;
		[FieldOffset(0x18)] public int _default;
		[FieldOffset(0x20)] public ElementType _fieldType;
		[FieldOffset(0x24)] public uint _isArray;
		[FieldOffset(0x28)] public uint _refTypeName;
		[FieldOffset(0x2C)] public DotNetData.DataRepresentation _dataRep;
	}
	[StructLayout(LayoutKind.Explicit, Size = 0x10)]
	public struct VvlParameterMeta
	{
		[FieldOffset(0x00)] public uint _sizeofSize;
		[FieldOffset(0x04)] public uint _name;
		[FieldOffset(0x08)] public uint _attributeIndex;
		[FieldOffset(0x0C)] public uint _attributeCount;
	}
	[StructLayout(LayoutKind.Explicit, Size = 0x14)]
	public struct VvlAttribute
	{
		[FieldOffset(0x00)] public uint _sizeofSize;
		[FieldOffset(0x04)] public uint _name;
		[FieldOffset(0x0C)] public uint unk0C;
		[FieldOffset(0x10)] public uint unk10;
	}
	[StructLayout(LayoutKind.Explicit, Size = 0x2C)]
	public struct VvlTypeDetails
	{
		[FieldOffset(0x00)] public uint _sizeofSize;
		[FieldOffset(0x04)] public ElementType _elementType;
		[FieldOffset(0x08)] public uint _isArray;
		[FieldOffset(0x0C)] public uint _typeReferenceName;
		[FieldOffset(0x10)] public int _interfaceOffset;
		[FieldOffset(0x14)] public int _interfaceCount;
		[FieldOffset(0x18)] public uint _name;
		[FieldOffset(0x1C)] public ushort _typeFlag;
		[FieldOffset(0x1E)] public ushort _memberCount;
		[FieldOffset(0x20)] public uint _fieldStartIndex;
		[FieldOffset(0x24)] public uint _attributeIndex;
		[FieldOffset(0x28)] public uint _attributeCount;
	}
	[StructLayout(LayoutKind.Explicit, Size = 0x1C)]
	public struct VvlGenericTypeDetails
	{
		[FieldOffset(0x00)] public uint _sizeofSize;
		[FieldOffset(0x04)] public uint _typeSpecName;
		[FieldOffset(0x08)] public ElementType _elementType;
		[FieldOffset(0x0C)] public uint _isArray;
		[FieldOffset(0x10)] public uint _someTypeReference;
		[FieldOffset(0x14)] public int _templateParameterOffset;
		[FieldOffset(0x18)] public int _templateParameterCount;
	}
	[StructLayout(LayoutKind.Explicit, Size = 0x50)]
	public struct VvlTypeDetailHeader
	{
		[FieldOffset(0x00)] public uint _sizeofSize;
		[FieldOffset(0x04)] public uint _stringTableLength;
		[FieldOffset(0x0C)] public uint _someOffset;
		[FieldOffset(0x10)] public uint _ILOffset;
		[FieldOffset(0x14)] public uint _ILCount;
		[FieldOffset(0x18)] public uint _methodDefOffset;
		[FieldOffset(0x1C)] public uint _methodCount;
		[FieldOffset(0x20)] public uint _methodRefCount;
		[FieldOffset(0x24)] public uint _ownedTypeOffset;
		[FieldOffset(0x28)] public int _ownedTypeCount;
		[FieldOffset(0x2C)] public uint _referencedTypeOffset;
		[FieldOffset(0x30)] public int _referencedTypeCount;
		[FieldOffset(0x34)] public uint _staticFieldOffset;
		[FieldOffset(0x38)] public int _staticFieldCount;
		[FieldOffset(0x3C)] public uint _fieldOffset;
		[FieldOffset(0x40)] public uint _fieldCount;
		[FieldOffset(0x44)] public uint _genericTypeOffset;
		[FieldOffset(0x48)] public int _genericTypeCount;
	}
	}
}